app/views/users/takeover_disputes.html.erb

  <tbody>
    <% if current_user.messages_for_admin.empty? %>
---
SELECT  1 AS one FROM "messages" INNER JOIN "users" ON "users"."id" = "messages"."user_id" WHERE "users"."admin" = ? LIMIT ?  [["admin", "f"], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" INNER JOIN "users" ON "users"."id" = "messages"."user_id" WHERE "users"."admin" = ?  [["admin", "f"]]