app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)

    respond_to do |format|
      if @message.save
---
INSERT INTO "messages" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Welcome to hostile takeover!!"], ["user_id", 0], ["created_at", "2017-12-03 22:07:36.015791"], ["updated_at", "2017-12-03 22:07:36.015791"]]