app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.password = user_params[:password]
    @user.active = true
    @user.admin = false
    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "password_hash", "active", "admin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def takedown_target
    if logged_in?
      if admin?
        target = User.find(params[:id])
        current_user.takedown_target(target)
        Message.where(user: target).destroy_all
        redirect_to '/takeover_disputes'
      else
        target = User.find_by(name: current_user.target)
---
SELECT  "users".* FROM "users" WHERE "users"."target" = ? LIMIT ?  [["target", "Tanu Balla 3"], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]
SELECT  "messages".* FROM "messages" WHERE "messages"."user_id" = 0 LIMIT ?  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Test User 4"], ["LIMIT", 1]]

  def reinstate_player
    if logged_in? && admin?
      target = User.find(params[:id])
      current_user.reinstate_player(target)
      Message.where(user: target).destroy_all
---
SELECT  "users".* FROM "users" WHERE "users"."target" = ? LIMIT ?  [["target", "none"], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 14]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = 0

    def set_messages
      @message = Message.new
      @messages = logged_in? ? Message.joins(:user).where(users: { admin: true }) : []
---
SELECT "messages".* FROM "messages" INNER JOIN "users" ON "users"."id" = "messages"."user_id" WHERE "users"."admin" = ?  [["admin", "t"]]