app/controllers/welcome_controller.rb

SELECT "messages".* FROM "messages" INNER JOIN "users" ON "users"."id" = "messages"."user_id" WHERE "users"."admin" = ?  [["admin", "t"]]
---
  def index
    @message = Message.new
    @messages = logged_in? ? Message.joins(:user).where(users: { admin: true }) : []